# ViT-Small (VasoMIM) backbone + ViTDet Simple Feature Pyramid + GELAN neck
# Stenosis detection — 512×512 grayscale input
#
# Architecture (ViTDet-style):
#   ViTEncoder (384d, stride 16)
#   → SFP projections with 3×3 refinement to P3/P4/P5
#   → GELAN-style PANet neck (RepNCSPELAN4 + ADown + SPPELAN)
#   → Anchor-free Detect head (DFL)
#
# Key difference from vit-yolov9.yaml:
#   SFP modules add learned 3×3 refinement convolutions after each scale
#   operation, creating richer multi-scale features vs bare Conv/ConvTranspose.
#
# Channel flow (512×512 input):
#   Layer 0  ViTEncoder  → (B, 384, 32, 32) stride 16
#   Layer 1  SFPUp       → (B, 256, 64, 64) stride 8   [P3]
#   Layer 2  SFPLevel    → (B, 512, 32, 32) stride 16  [P4]
#   Layer 3  SFPDown     → (B, 512, 16, 16) stride 32  [P5]
#   Layer 4  SPPELAN     → (B, 512, 16, 16)
#   ...GELAN neck...
#   Layer 10 P3/8  out   → (B, 256, 64, 64)
#   Layer 13 P4/16 out   → (B, 512, 32, 32)
#   Layer 16 P5/32 out   → (B, 512, 16, 16)
#   Layer 17 Detect      → boxes + class scores

nc: 1  # stenosis

# Backbone — ViT-Small encoder + Simple Feature Pyramid
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ViTEncoder, [384, 512]]          # 0: (B,384,32,32) stride 16
  - [0, 1, SFPUp, [256]]                     # 1: (B,256,64,64) stride 8  [P3]
  - [0, 1, SFPLevel, [512]]                  # 2: (B,512,32,32) stride 16 [P4]
  - [0, 1, SFPDown, [512]]                   # 3: (B,512,16,16) stride 32 [P5]
  - [-1, 1, SPPELAN, [512, 256]]             # 4: SPPELAN

# Head — GELAN-style PANet neck (YOLOv9) + Detect
head:
  # --- top-down path ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 5: upsample P5 → 32×32
  - [[-1, 2], 1, Concat, [1]]                    # 6: cat (512) + P4(512) = 1024
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]    # 7: → 512

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 8: upsample → 64×64
  - [[-1, 1], 1, Concat, [1]]                    # 9: cat (512) + P3(256) = 768
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]]    # 10: P3/8 output (256)

  # --- bottom-up path ---
  - [-1, 1, ADown, [256]]                        # 11: downsample → 32×32
  - [[-1, 7], 1, Concat, [1]]                    # 12: cat (256) + layer7(512) = 768
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]    # 13: P4/16 output (512)

  - [-1, 1, ADown, [512]]                        # 14: downsample → 16×16
  - [[-1, 4], 1, Concat, [1]]                    # 15: cat (512) + SPPELAN(512) = 1024
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]    # 16: P5/32 output (512)

  - [[10, 13, 16], 1, Detect, [nc]]              # 17: Detect(P3, P4, P5)
